Examples/mhdEpotFoam/0/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (0 100 0);

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (0 100 0);
    }

    botWall
    {
        type            fixedValue;
        value           uniform (0 100 0);
    }

    inlet
    {
        type            zeroGradient;
    } 
    
    outlet
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 100 0);
    }
}

// ************************************************************************* //
