Examples/mhdEpotFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);

    }

    botWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
	    value           uniform (0.01 0 0);
    } 
    
    outlet
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
