Examples/mhdEpotFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -1 -1)
    (10 -1 -1)
    (10 1 -1)
    (0 1 -1)
    (0 -1 1)
    (10 -1 1)
    (10 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 100 100) simpleGrading 
    (
        //x  
        1			

        //y
        (			
            (0.2 0.3 10)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.3 0.1) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)

        )

        //z
        (			
            (0.2 0.3 10)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.3 0.1) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)

        )
    )
);


edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    botWall
    {
        type wall;
        faces
        (
            (0 1 4 5)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 5 2 6)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
